{"defcore": ["Right now, we're pretty focused on trying to overhaul the backend side of HTS. That is our primary focus at this point as it will (hopefully) bring in some more traffic as we push out nicer and better things.", "If you are referring to basic mission 1, it does not ask you to enter YOUR password. Instead it asks you to enter THE password for mission 1. Completing the mission requires basic knowledge of html."], "SecretS19": [""], "mShred": ["Nice!", "I agree. Perhaps if that was a fedora or something, that'd be titties.", "I'm not part of the dev team, but I believe this forum is a bit separate from the rest of hts. This forum needs to issue a unique session ID to the user, and it's powered by phpBB, so I am assuming it's some source compiled and ran on the server that takes care of all that. To be short, I believe you have to click to login, once you do, it checks if you are logged into the main hts page with a valid session, etc, if that passes, it will log you into the forum with your unique session id and username here.However, I could be wrong about all of this.", "In short, yes. But with the setup that we currently have, it'd be tedious. The phpbb forums have been tweaked to work with HTS and as anyone can imagine, tweaking brings problems/bugs.", "Same here, sounds like he should check into his actual computers security. It doesn't look like anything related to the form used for changing the password from my pov.", "It's something on his end. Guaranteed. But cent's right, gettin a bit off le topic now.", "This is a great idea. We've been pondering these challenges for a while now and will (hopefully) start pushing some out in the near future.Thanksgiving Paltry wrote:Well, one thing I would add is a more professional looking theme. It's nothing against you guys, but it just looks unprofessionally dark. I know this website is supposed to be educational, but to be taken seriously in that respect you kinda have to look the part.This is something that we're all in a debate about. We are certainly going to update the layout, but the debate is on what theme we want to end up using.", "If only something like that existed...", "We haven't ported our site to other languages. Have you tried using a translating service? Google can offer some help there to make things easier.", "Someone who isn't me should definitely jump onto this ", "Right now, we're pretty focused on trying to overhaul the backend side of HTS. That is our primary focus at this point as it will (hopefully) bring in some more traffic as we push out nicer and better things.", "I thought everything was relevant in coffeesh0p, isn't this the thread that mimics #coffeesh0p on IRC? If not, where is that one?limdis wrote:#coffeesh0p is love.#coffeesh0p is life.Yup ", "Really? And I quote (from the first 2 pages):Monica wrote:weekend, mmmmmmmmm....limdis wrote:mooka get in here you are missing outxRobin3x3x wrote:Hi, hope you don't mind, i needed a refill on coffee.tremor77 wrote:What is this coffeesh0p? I didn't read the first post.. yes i'm trolling.. just wanted to say hi to Limdis!Oh, look at all that off-topicness (and I vote to keep it that way). But hey, I'm just the messenger ", "All of those responses are completely relevant to the topic, which is #coffeesh0p. Except for Manica's response obviously. I'm not sure what you're not understanding here, but perhaps this might help? Either way. Like I've already said. There's a difference in having a thread where people can fuck around and then having someone completely derail the thread with a question that could and SHOULD have been opened by a normal thread (hence normal forum operation). Now unless you'd like to continue arguing a pointless point, and further derail this thread, I'd ask you to let it be.-Ninjex- wrote:If you are going to keep posting off topic or would like to discuss it further, take it to a pm, it's there for this kind of stuff.This.", "IRC requires a client to use. What operating system are you using? There are different clients for different OS's. You can always use Mibbit, a web-based client. The details for the server, port and channel are as follows:Server: irc.hackthissite.orgPort: 7000 (SSL)Channel: #coffeesh0pYou'll have to choose a nick. Depending on your client, you may need to issue certain commands to join channels, usually \"/join #coffeesh0p\". If you have any other specific questions, post em here."], "thenoobcoder": ["I attempted to update the list with Kali Linux.I'm not sure if the submission is working correctly. Upon submitting the form, nothing happens from the insert.php script; there is no notification as if the submission was successful or non-successful.Details on my submission:Code: Select allName: Kali LinuxDesc:Kali Linux, a project designed by offensive security, is a professional penetration testing operating system, based on debian and uses an FHS-compliant system. This means that the operating system is more stable, and is able to call all of the tools from any directory, regardless of your position in the directory tree. Kali Linux includes all the tools which come with Backtrack, along with a few additions. Linky:http://www.kali.org/Pic (not required):http://www.kali.org/wp-content/uploads/2013/03/kali-home-large-slider2.jpgType of object:***none assigned***Cat:Hacking toolsOS: LinuxI also believe on the page that Link has been misspelled to Linky.edit**I just seen the update where the JavaScript 3 mission is being fixed, so I have to ask. When will we be seeing a patch for that damned application challenge, you all know which one I'm talking about."], "TheTechBrony": ["Flawless", "Oh, yes, I am. I've been looking for opportunities to DJ on the Internetz before taking to the radio.-- Fri Nov 07, 2014 9:53 am --cyberdrain wrote:While I'm hesitant to shoot down a good idea, please consider the implications of what you're asking: what is it you would want to hear, what would be done there and who should do it? Aside from those practical problems, I see no reason not to start it up again.Your concerns are, of course, very valid. We should probably start a poll concerning the content. Then, we'd have to find a host site to have the audio-stream on. I'd be glad to take on whatever early responsibilities there are with starting the station that haven't already been assigned/taken. If anybody volunteers, all positions are open.", "Thanks!, gonna check out IRC (Honestly don't know what that is but I'm sure one of the threads will inform me) and I will chill out around the forum 'watercooler' as it seems :3 Thank you!"], "Grand_Irish": ["IRC requires a client to use. What operating system are you using? There are different clients for different OS's. You can always use Mibbit, a web-based client. The details for the server, port and channel are as follows:Server: irc.hackthissite.orgPort: 7000 (SSL)Channel: #coffeesh0pYou'll have to choose a nick. Depending on your client, you may need to issue certain commands to join channels, usually \"/join #coffeesh0p\". If you have any other specific questions, post em here.", "Thanks for the reply. Well, I have a dual-boot for Windows X and Ubuntu. Now, this brings me to another problem. My Ubuntu went all tard on me. It loads but there is not way to close windows and I cannot get to the Terminal to fix my Ubuntu. When it boots it gives me an error. I know how to set the root and the prefix and get the ins mod to load normal, but I don't know how to fix my Ubuntu. Do I just format the partition and start over? But then if I do, I know my Windows will spasm when I re-load the Ubuntu onto the system. Anyway... I am the ultra NOOB. I want to be decent at hacking, but am a latent learner and feel like I might have missed the \"train\" for becoming a great hacker. I am just rambling. Ultimately, I have mIRC downloaded, but I will try the server you offered. I really need to get with it and learn as much as I can. Thanks again."], "hellow533": ["You mean for Mobile users? That would be the goal of a new mobile interface (which is mostly CSS). Also with a new forum, it would be easier to implement a better mobile experience with the forums as well.That said, an app is most likely out of the question for now, but a m.hts.io (mobile HTS) is likely to come in the near future.hellow533 wrote:How about mission-like interactive tutorials.I assume you mean along the lines of a CodeAcademy style? This is a very good idea and will most likely be implemented when we get past the \"repair\" stage of HTS. Thanks for the input.", "Add TCPdump and Dsniff to the list.", "This something that many many people have asked for and it's been in high debate in the IRC chat #cofeesh0p for a while now."], "t3jiri": ["Hey limdis, I sent an email to staff.  I hope to hear back from you guys soon!-- Thu May 12, 2016 9:24 am --Message to all the staff mainly Ninjex, Limdis, Kage, and Weekend. This is for the front end dev volunteering that I interviewed with ninjex for:Since I keep hopping on the IRC at bad times, I just wanted to let you guys know so you don't miss my message and to ensure you guys get it. I interviewed with ninjex, went pretty well. He asked me to do a project, I've been really busy the last few weeks, just got kicked out of my place to stay and I have about 2 months with a buddy of mine to get a new place to live, so I've had a really rough past month or so and I'm in a transitional/waiting period for a new job and living quarters. Due to that, I have a lot of time to wait. I've decided for my project I'm going to make a sample modern version of the HTS website. If you guys would like me to do something different let me know but for now that's what I've decided for my project. Credit to limdis for helping me pick something to do.I really love the concept of this site and I would be a very happy little hacker if our community grows. I think the outdated style of the website kind of draws people away from it or makes them hesitant to use it to learn. and I want to help change that. Sorry I've been slacking with this project but like I said I've had a really rough past few weeks.Anyways, I love this site, I would love to be part of your team, and I would love to help in any way I can and I hope you guys bring me on to the team. I think working with you guys would be an amazing opportunity and it would help me build my webdev portfolio EXTREMELY, but overall I just want to give back to the community.Thank you all for reading, I hope you guys have a good day. I believe ninjex has my email. If you guys would like to contact me then please feel free to PM on the forums on here, or the main website messaging, or by emailing me. Happy hacking!  "], "SprawlUlfr": ["Heh, yes you can, same for me. It's great you remember me though. I keep checking the site once in a while, but usually I don't log in. Being here taught me an important lesson: once you start learning it's hard to stop (no matter where I am).@Limdis: To be honest: I didn't check IRC, so if you're talking about that...", "feel free to come to irc and hang around #coffeesh0p and say hi, there's usually someone alive at least half the time there.", "Thanks!, gonna check out IRC (Honestly don't know what that is but I'm sure one of the threads will inform me) and I will chill out around the forum 'watercooler' as it seems :3 Thank you!"], "Clarinda": [], "Res_12": [], "c0untz3r0sum": [], "cyberdrain": ["Every mission states what is needed to complete it and gives you resources in doing so. To explain every topic that the missions cover would take a ton of time that we don't really have, which is why we link to outside material.", "Flawless", "While I'm hesitant to shoot down a good idea, please consider the implications of what you're asking: what is it you would want to hear, what would be done there and who should do it? Aside from those practical problems, I see no reason not to start it up again. I mean, I recall someone saying that if anyone wanted to be the DJ, they could be. Are you volunteering, TheTechBrony?", "Oh, yes, I am. I've been looking for opportunities to DJ on the Internetz before taking to the radio.-- Fri Nov 07, 2014 9:53 am --cyberdrain wrote:While I'm hesitant to shoot down a good idea, please consider the implications of what you're asking: what is it you would want to hear, what would be done there and who should do it? Aside from those practical problems, I see no reason not to start it up again.Your concerns are, of course, very valid. We should probably start a poll concerning the content. Then, we'd have to find a host site to have the audio-stream on. I'd be glad to take on whatever early responsibilities there are with starting the station that haven't already been assigned/taken. If anybody volunteers, all positions are open.", "I'd like to see more webpages and member areas that are only accessible BY hacking.It's one thing to have missions, but it'd be cool if like a secret society you could only access a deep message board somewhere i you knew how to hack it.  Make them also beginner, middle, expert levels.", "If only something like that existed...", "Right now, we're pretty focused on trying to overhaul the backend side of HTS. That is our primary focus at this point as it will (hopefully) bring in some more traffic as we push out nicer and better things.", "We aren't going to ask people to do something that they already haven't offered to do. If you want to make some tutorials then go ahead. You can submit them here.", "Thanks for the history lesson, weekend.  ", "Hey tremor, we have got a lot to talk about good sir, as I'm sure you are well expecting. Good to see you back  ", "Heh, yes you can, same for me. It's great you remember me though. I keep checking the site once in a while, but usually I don't log in. Being here taught me an important lesson: once you start learning it's hard to stop (no matter where I am).@Limdis: To be honest: I didn't check IRC, so if you're talking about that...", "Thanks!, gonna check out IRC (Honestly don't know what that is but I'm sure one of the threads will inform me) and I will chill out around the forum 'watercooler' as it seems :3 Thank you!", "I thought everything was relevant in coffeesh0p, isn't this the thread that mimics #coffeesh0p on IRC? If not, where is that one?limdis wrote:#coffeesh0p is love.#coffeesh0p is life.Yup ", "Really? And I quote (from the first 2 pages):Monica wrote:weekend, mmmmmmmmm....limdis wrote:mooka get in here you are missing outxRobin3x3x wrote:Hi, hope you don't mind, i needed a refill on coffee.tremor77 wrote:What is this coffeesh0p? I didn't read the first post.. yes i'm trolling.. just wanted to say hi to Limdis!Oh, look at all that off-topicness (and I vote to keep it that way). But hey, I'm just the messenger ", "Ty, i appreciate it. ", "We should also consider the flip side of this.. first of all, I'm going to assume or hope at least, that if I made a tweet with all my 21 followers, about hacking a plane while I was on a plane, that it more or less would go unnoticed?  (Correct me if you think this is wrong).  Does our cyber security apparatus have the ability to find these tweets as such, or is it that Chris Roberts has already established a high profile, and deliberately planned for this tweet to be seen as much as a media gag to get noticed as anything else?Secondly, a threat against a passenger aircraft or airport, bomb or otherwise, is a federal crime. Whether or not the threat is substantial, credible or joking, it does not matter.. the threat is the crime. It causes panic amongst passengers and the loved ones of passengers, it causes airlines and airports to change flights, delay flights, and it mobilizes security personnel to assess the threat irregardless of whether or not they believe it to be substantial, credible or joking.. because if they disregard a threat that becomes something, all holy hell will break loose in asking why they didn't act.  All this to the tune of tens of millions of taxpayer dollars and economic interuption - all for a tweet or a phone call or a letter.  Even in joking, it is a massive lack of judgement on Roberts' behalf in not understanding the consequences beyond his self-centered and self-important little world.  His tweet was a calculated and either career or politically motivated planned action to cause the ensuing debate around it.  We should not forget that.  We would detain an EOD Specialist, et al.. had they made a threat to act in a harmful manner. I have been employed as a security researcher... my job is to do the research and submit my findings to the proper management/administration, so that it may get fixed, not to tweet a potential 0-day or vulnerability for every other hacker in the world to see and then potentially use.  So Roberts' was displeased that the airlines response was slow in fixing things he had found, does that make it right to do what he did?", "So thinking about something and talking about that is a crime? Or is this just another thing that got them scared out of their wits knowing no-one thought about it before and someone actually points out the risks?tremor77 wrote:We would detain an EOD Specialist, et al.. had they made a threat to act in a harmful manner. I have been employed as a security researcher... my job is to do the research and submit my findings to the proper management/administration, so that it may get fixed, not to tweet a potential 0-day or vulnerability for every other hacker in the world to see and then potentially use. So Roberts' was displeased that the airlines response was slow in fixing things he had found, does that make it right to do what he did?It's industry standard to disclose bugs who haven't been fixed after a while too. While I don't know how long this particular item was held back or how slow the response was and while the phrasing was off, the intent of joking was obvious to me. Apparently others didn't think so.tremor77 wrote: Even in joking, it is a massive lack of judgement on Roberts' behalf in not understanding the consequences beyond his self-centered and self-important little world. His tweet was a calculated and either career or politically motivated planned action to cause the ensuing debate around it. We should not forget that. I don't care to speculate about that (same could be said about the response) or do you have some proof to back that up?I'm not saying staying idle was the best response. However, at the risk of speculating myself and backed up by previous cases, the way it was handled was clearly to scare others into not doing it. It creates an environment where security-holes remain open and exploitable for criminals as well as the good guys, something that's even worse in my opinion.", "This is a necro.", "That, basically. I understand their fear of 'going dark', but it's no different than the way it's always been. Besides, the risks don't outweigh the possible benefits; too much power, too little responsibility.", "tremor77 wrote:Addendum: If it were in my power to do so, I would fire every single person involved in the development of this idea because it is that fucking stupid, they have no right to earn taxpayer dollars for that amount of idiocy. I wouldn't even recommend them for drive-thru teller at McDonalds. Seriously.I understand taking this stance, but I think it's important to remember a few things. Consider that the ones proposing this idea are not professionals in any industry that requires them to know how these things work. It would be nice if they did, but in reality we can't expect everyone involved in the process to have a good understanding of things that are this complex. For the record, I don't think any of them are pretending to understand it. This kind of thing is not uncommon, which is why we don't leave all of the important decisions up to one person. Although it's less than ideal that time and money is being wasted on this idea, even if it's just to make the proposition, I don't think \"stupid\" is fair. Ignorant?  Definitely. In their shoes, however, it may not seem like a bad idea to at least pitch this. They've been told it's not possible, but they have all kinds of history books that tell them all about the \"impossible\" things people have achieved. Around here, we know that perfect security is far-fetched and silly to even consider, but it wasn't that long ago that Joseph Bramah had people reasonably convinced otherwise, and not because people used to be stupid. I imagine these people are just hoping for a revolutionary innovation, not just some back pocket crypto-trick. I imagine the majority of these people are good at what they do, but it's obvious that what they do has very little to do with this particular kind of security. Thankfully, it isn't up to them.cyberdrain wrote:I understand their fear of 'going dark', but it's no different than the way it's always been. Besides, the risks don't outweigh the possible benefits; too much power, too little responsibility.I think that's what makes the conversation difficult. One thing outweighing another is inevitable when the industry is essentially an arms race. Although the fear of \"going dark\" seems real enough to justify this kind of proactivity, I think it's reasonable to suspect that this proposition is being made for reasons other than fear. It's hard to say exactly what those reasons are, but it feels like mass surveillance certainly fits the federal agenda nowadays.", "That's an interesting idea, if that were allowed, it would mean squashing any resistance against the way things are, never allowing for change once things get out of hand. Unfortunately we're pretty close to that already. As with every new technology there are those who resist change and those who accept it. The difference in this case being that there is no way to ever decode the encrypted messages when encryption is correctly used. As knowledge is power, not having knowledge means having no power. In this case the balance favours those who use it against any government for e.g. civil disobedience. This is why the right to encrypt things should be protected at all costs in my opinion.", "It would certainly seem that way. This whole iShitstorm really seems to encapsulate the dilemma that is a crypto skeleton key.This trick is nothing new. We see it all the time. Find a terrorist, hypocritically attempt to use the momentum of their terror to dissolve the constitution, void civil liberties, and hope the people stand behind you while you do it. Pretty ridiculous.Apparently the FBI just ended up dishing out cash to get into the phone. If James Comey can't take your freedom, he'll just spend your money. Brilliant.", "The good news is that they can't keep doing that, so they'll have to invest a lot to actually gain access to new phones."], "0c3107": [], "NETWORKsecurity": ["Hell yeah! I smile whenever I see Justin Biebers face pasted on the banner  ", "Cause cicada 3301 doesnt like competition  . That kind of mission would be fun but there are some problems. There used to be doxing mission but now its defunct because people were posting solutions and google search results didnt appear like they were supposed too  ."], "rojo": [], "3ly5ium": ["Works for me. "], "aConvolutedConscious": [], "rossi123": ["me need a lot of help, can you please help me?"], "HackNoob592": ["I disagree. First, .org doesn't stand for anything other than \"organization\" which we are. Second, the site is designed to force the user to learn for themselves. Beating the basic missions is quite easy if you put some effort into it and read everything we provide (hints, clues, descriptions, articles, forums threads, etc). If a user is unwilling to put in the effort to learn, they will not be spoon-fed and they will not do well in NetSec.Edit: I'm not saying the challenges are perfect. They are far from that. They are old, poorly written in some cases, and often more of a needle-in-a-haystack than intelligent puzzles. At the same time, they are \"Missions\" not walkthroughs."], "nickee89": ["O...M....G... OMG... omg, omg omg omg"], "seeking": [], "uraharasama1": [], "Thanksgiving": ["beforem3 wrote:Hi, I hope I can still post on this topic for an idea... anyway.I was looking for books in the specific forum and I think you can make a survey for books. Votes of members with a really high rank in users ranking are higher than votes by members like me that have a really low rank.I think in this way we can have a list of books ranked by hackers.What do you think?CheersWell apart from recommending you check out the books subforum, This isn't a bad idea, thing that jumps out at me though is that when I look on amazon for books, I will check the star rating, no doubt. But I pay more attention to the qualitative reviews people have given, which is what you will find in the books sub forum."], "phantomhackers": [], "learner_0786": ["Every mission states what is needed to complete it and gives you resources in doing so. To explain every topic that the missions cover would take a ton of time that we don't really have, which is why we link to outside material.", "Thanks for the advice "], "CryptoMind": ["I agree with hellow533. It would be much better if his idea would be implemented as it will make users stick to the site.HTS users are mostly teenagers who want to learn to hack but they also have to study and so cannot devote much time to finding and learning stuff on other sites and completing mission on HTS.I joined HTS to learn hacking and hoped to find tutorials and missions based on them.But i have to learn stuff from other sites. Missions are a great help though.HTS is good but it would be amazing if we get tutorials on the site itself.Yet i appreciate the site owner's effort as he puts no ads and runs this site entirely by his money and donations."], "Katamoto": ["Nice!", "I agree. Perhaps if that was a fedora or something, that'd be titties.", "Someone who isn't me should definitely jump onto this "], "Amazingred": [], "John-Doe252": ["I attempted to update the list with Kali Linux.I'm not sure if the submission is working correctly. Upon submitting the form, nothing happens from the insert.php script; there is no notification as if the submission was successful or non-successful.Details on my submission:Code: Select allName: Kali LinuxDesc:Kali Linux, a project designed by offensive security, is a professional penetration testing operating system, based on debian and uses an FHS-compliant system. This means that the operating system is more stable, and is able to call all of the tools from any directory, regardless of your position in the directory tree. Kali Linux includes all the tools which come with Backtrack, along with a few additions. Linky:http://www.kali.org/Pic (not required):http://www.kali.org/wp-content/uploads/2013/03/kali-home-large-slider2.jpgType of object:***none assigned***Cat:Hacking toolsOS: LinuxI also believe on the page that Link has been misspelled to Linky.edit**I just seen the update where the JavaScript 3 mission is being fixed, so I have to ask. When will we be seeing a patch for that damned application challenge, you all know which one I'm talking about."], "saleonleather": ["I'm so out of the loop these days but I'm hearing less and less about PHP. It's like flash, was absolutely dominant for a good few years and fell off the map. I've always wanted to contribute to this site but I imagine the technical debt would be exhausting.Good luck guys, hope you aren't dead."], "Jakko355": [], "NotHackingUatall": ["Hell yeah! I smile whenever I see Justin Biebers face pasted on the banner  "], "Cangri": [], "Prince": [], "DrRoach": [], "Phatez_": [], "zeifu": ["This is a necro."], "v4ry5": ["I'm not part of the dev team, but I believe this forum is a bit separate from the rest of hts. This forum needs to issue a unique session ID to the user, and it's powered by phpBB, so I am assuming it's some source compiled and ran on the server that takes care of all that. To be short, I believe you have to click to login, once you do, it checks if you are logged into the main hts page with a valid session, etc, if that passes, it will log you into the forum with your unique session id and username here.However, I could be wrong about all of this."], "Efe_mariere": ["I've got version 2999 in a folder on my desktop. My upgrade license ran out. Super down about it."], "chel_park": [], "KeyloggerLove": [], "anarchy420x": ["Very much so! Sometimes it gets quiet during certain times of the day but it does stay fairly active."], "xyl0c": ["something you can quickfix?the anti-exploit system on basic missions 8&9 is way too strict, to the point where even solution found online don't work anymore. You could fix that.-- Thu Oct 01, 2015 9:33 am --also, you could try having people go to the Https version of the site by default. that would actually be amazing.-- Thu Oct 01, 2015 9:35 am --I do like my websites to be dark though, it's just so much easier on the eyes."], "gotaquestion": ["Hell yeah! I smile whenever I see Justin Biebers face pasted on the banner  "], "Broccoli233": [], "molanDankil": ["I think this sums it up pretty well. There's no question in my mind that the tweet was poor judgement by Chris Roberts (unless he was in fact aiming for a news story), but the consistent federal knee-jerking clusterfuck that surfaces whenever something like this happens speaks volumes about these backwards priorities.Sometimes it seems like things only blow up like this when somebody can put a terrorist spin on things, which is horribly easy to do these days with anything relating to cyber \"threats\". Even though the joke was made at the wrong time and place, it was still a very obvious joke. While I understand the need to respond to these things regardless of perceived intentions, I can't help but wonder if we'd all be a little more secure should the powers that be ever decide to focus more on quashing the stigma that comes with responsibly disclosing security vulnerabilities, whether or not there was ever any permission.", "It's certainly a bit overkill to detain this guy for hours... what they should have been concerned with was learning how or if the plane was actually compromised and patched the problem.  Society is too swift to condemn individual acts of (really like that term:) cybercomedy.  While not quite a safe thing to do, he could have been smarter about it, but still they didn't have to jump down his throat.They should have talked to Chris in a peer-to-peer setting, get some kind of report on what it took to hack the plane systems.  They could learn how to keep this from happening, or redirect a potential malicious attacker to an in-flight honeypot or something.He probably should have gotten in touch with the airline and disclosed the vulnerability quietly though... a website is one thing, a chunk of metal hurling through the air, a little different... ^^^highly agree with pretentious, in which we need more software developers in this world that are educated.  Perhaps even focused solely on hardening programs and making them more robust instead of pumping out new, pretty-looking shit that is full of vulnerabilities...I still remember when Vista came out... Microsoft's commercials were focused on, \"oh wow, it looks great!\"  Not once did I hear a commercial say, \"it's robust, solid, and very few bugs!  This sucker will stand up to attacks for days!\"  Nope... appearance is all that matters apparently...Education is what this world needs, and a learning mentality instead of persecution mentality."], "Vagabond_15": [], "SmokeyThaBear254": ["I already do this  and when the challenge goes unsolved for a REALLLY long time, i make it public in the forums."], "n0ms3c": ["Thanks for the history lesson, weekend.  "], "OS_13115": ["Thanks for the advice "], "nhtuyenbk": ["We aren't going to ask people to do something that they already haven't offered to do. If you want to make some tutorials then go ahead. You can submit them here."], "skyling999": ["Ty, i appreciate it. "], "DaC0unt": [], "limdis": ["Nice! Thanks for the submission! I like that old school look to it.", "Nice, now we're getting somewhere..  I still need some creative inspiration but I'm hoping someone might try to tackle my stego for gigglesEdit: got some inspiration and tried something different:  http://pwn9.org/images/hts5.png", "We can always add stego later (and probably will)  ", "Nice!", "I agree. Perhaps if that was a fedora or something, that'd be titties.", "Future missions are likely to include this. We've discussed this a lot in the past and all are agreed this is a decent idea as long as it is implemented correctly. For the old/current missions I've brought up having a link to a full blown explanation of the vulnerability, to include how find it and prevent it from happening. The link would be shown upon completetion.", "It's something on his end. Guaranteed. But cent's right, gettin a bit off le topic now.", "O...M....G... OMG... omg, omg omg omg", "Flawless", "Right now, we're pretty focused on trying to overhaul the backend side of HTS. That is our primary focus at this point as it will (hopefully) bring in some more traffic as we push out nicer and better things.", "wow...i LOVE it!! ok i would love to see thiss happen and am willing to do anything i can to help mooka", "We aren't going to ask people to do something that they already haven't offered to do. If you want to make some tutorials then go ahead. You can submit them here.", "I don't like to miss an opportunity for a social experiment on irc. If it turns out to be needed then I'll register or let someone else register and set some ops.But in my opinion, some of the best channels don't even need ops, even if ops exist almost no one knows who they are and it only gets used in case of emergency every few years or so. Maintaining a pleasant environment is more up to the users than to those that need to punish offenders.Want to kill a troll? Shower it with kindness. 60% of the time it works every time.", "Busy with college among other things. We could almost say the same about you!", "Hey tremor, we have got a lot to talk about good sir, as I'm sure you are well expecting. Good to see you back  ", "Ty, i appreciate it. ", "Very much so! Sometimes it gets quiet during certain times of the day but it does stay fairly active."], "Cattt": ["Thanks for the advice "], "Goatboy": ["It's something on his end. Guaranteed. But cent's right, gettin a bit off le topic now."], "methbb": ["wow...i LOVE it!! ok i would love to see thiss happen and am willing to do anything i can to help mooka"], "666shift": [], "beefatoni47": ["I've got version 2999 in a folder on my desktop. My upgrade license ran out. Super down about it."], "oasis": ["Be careful everyone.  We have a 1337 H4x0r out there."], "Kage": [], "Douglas112": [], "GeeBee123": [], "daedeluslanthanien": ["You can log into the IRC server directly, there's no need to go through the browser for your client. Server: irc.hackthissite.orgDefault port: 6667SSL Ports: 6697,7000Also, you only need to use the DLL if you want to make things easier for you over SSL with mIRC. It's most definitely not a required thing to use.", "In '08 or '09 a new version of HTS was released and the forums reset (as far as I know) which is why you won't find anyone with a join date before then (including administrators like Kage, weekend, or ScrAm).", " The IRC link does not simply display the IRC info; it actually prompts to open the IRC client. I had to pull the info out of the bitch boxes. Afterwards I tried numerous times to connect to the server and was denied. Upon reading the IRC help I noticed the .DLLs and the instructions really seem like the .DLLs are required. SOOOOOOOO?....... and yes I manually did a 7000 port in the client.", "As this link states:That link wrote:Most users are using mIRC, a very nice Windows IRC client. HackThisSite has taken the effort to make using SSL on mIRC a little easier. Also note that below that it shows how to get it working with X-Chat, something that doesn't require any DLL's, just the '-ssl' flag. Or, you could use IRSSI (like I do) that also doesn't require you to install a DLL for SSL to be enabled."], "lcolas": [], "TheProThC": ["Flawless"], "brutal_hacker": ["I attempted to update the list with Kali Linux.I'm not sure if the submission is working correctly. Upon submitting the form, nothing happens from the insert.php script; there is no notification as if the submission was successful or non-successful.Details on my submission:Code: Select allName: Kali LinuxDesc:Kali Linux, a project designed by offensive security, is a professional penetration testing operating system, based on debian and uses an FHS-compliant system. This means that the operating system is more stable, and is able to call all of the tools from any directory, regardless of your position in the directory tree. Kali Linux includes all the tools which come with Backtrack, along with a few additions. Linky:http://www.kali.org/Pic (not required):http://www.kali.org/wp-content/uploads/2013/03/kali-home-large-slider2.jpgType of object:***none assigned***Cat:Hacking toolsOS: LinuxI also believe on the page that Link has been misspelled to Linky.edit**I just seen the update where the JavaScript 3 mission is being fixed, so I have to ask. When will we be seeing a patch for that damned application challenge, you all know which one I'm talking about."], "atulsimn09": [], "CeaseesaeC": [], "bren2016": ["Ya after I went and diddled about with photoshop for an hour and posted a quick image i made, I re-read my original post and felt it made me look like a nerdy-try-hard..  lol -  I like what JB did I was trying to think of encrypting some message into mine or using some greater symbolism but the creativity just ain't in my head these days....Updated my logo with a fun stego / brain teaser challenge - most all the clues are available in the image, only some minimal guessing required...    http://pwn9.org/images/hts4.png"], "MariaDPettiford": [""], "dannyjonesmws": [], "idletester2018": ["I've got version 2999 in a folder on my desktop. My upgrade license ran out. Super down about it."], "davegerber": [], "mookalovesgloop": ["As this link states:That link wrote:Most users are using mIRC, a very nice Windows IRC client. HackThisSite has taken the effort to make using SSL on mIRC a little easier. Also note that below that it shows how to get it working with X-Chat, something that doesn't require any DLL's, just the '-ssl' flag. Or, you could use IRSSI (like I do) that also doesn't require you to install a DLL for SSL to be enabled.", "This something that many many people have asked for and it's been in high debate in the IRC chat #cofeesh0p for a while now.", "wow...i LOVE it!! ok i would love to see thiss happen and am willing to do anything i can to help mooka", "hehe, its funny because its not.Its just that the trolls haven't found it yet. But there are no ops or anything to keep it noob friendly in case of emergency.History lesson: #coffeesh0p was the former channel of www.coffeesh0p.com a site created by a member of this community some 5 years or so ago. I idle in there because.. I like to sometimes idle in empty legacy channels for way way too long.Now its being taken over by friendly people. I approve of this."], "DarkDexter": ["Thanks for the history lesson, weekend.  "], "RiptideTempora": ["beforem3 wrote:Hi, I hope I can still post on this topic for an idea... anyway.I was looking for books in the specific forum and I think you can make a survey for books. Votes of members with a really high rank in users ranking are higher than votes by members like me that have a really low rank.I think in this way we can have a list of books ranked by hackers.What do you think?CheersWell apart from recommending you check out the books subforum, This isn't a bad idea, thing that jumps out at me though is that when I look on amazon for books, I will check the star rating, no doubt. But I pay more attention to the qualitative reviews people have given, which is what you will find in the books sub forum."], "SenpaiSimon": [], "Pheonix": [], "Rdube123": [], "techblogs": ["I'm so out of the loop these days but I'm hearing less and less about PHP. It's like flash, was absolutely dominant for a good few years and fell off the map. I've always wanted to contribute to this site but I imagine the technical debt would be exhausting.Good luck guys, hope you aren't dead."], "TinaNamdev": ["me need a lot of help, can you please help me?"], "khyzen": ["I already do this  and when the challenge goes unsolved for a REALLLY long time, i make it public in the forums.", "me need a lot of help, can you please help me?"], "SpiceyTuna": ["Very much so! Sometimes it gets quiet during certain times of the day but it does stay fairly active."], "moak": ["Works for me. "], "FirstYolah": [], "Gunjafarmer": ["Right now, we're pretty focused on trying to overhaul the backend side of HTS. That is our primary focus at this point as it will (hopefully) bring in some more traffic as we push out nicer and better things."], "Mistery005": [], "poetics5": ["It's certainly a bit overkill to detain this guy for hours... what they should have been concerned with was learning how or if the plane was actually compromised and patched the problem.  Society is too swift to condemn individual acts of (really like that term:) cybercomedy.  While not quite a safe thing to do, he could have been smarter about it, but still they didn't have to jump down his throat.They should have talked to Chris in a peer-to-peer setting, get some kind of report on what it took to hack the plane systems.  They could learn how to keep this from happening, or redirect a potential malicious attacker to an in-flight honeypot or something.He probably should have gotten in touch with the airline and disclosed the vulnerability quietly though... a website is one thing, a chunk of metal hurling through the air, a little different... ^^^highly agree with pretentious, in which we need more software developers in this world that are educated.  Perhaps even focused solely on hardening programs and making them more robust instead of pumping out new, pretty-looking shit that is full of vulnerabilities...I still remember when Vista came out... Microsoft's commercials were focused on, \"oh wow, it looks great!\"  Not once did I hear a commercial say, \"it's robust, solid, and very few bugs!  This sucker will stand up to attacks for days!\"  Nope... appearance is all that matters apparently...Education is what this world needs, and a learning mentality instead of persecution mentality."], "pitabit": [], "sabin007": ["I attempted to update the list with Kali Linux.I'm not sure if the submission is working correctly. Upon submitting the form, nothing happens from the insert.php script; there is no notification as if the submission was successful or non-successful.Details on my submission:Code: Select allName: Kali LinuxDesc:Kali Linux, a project designed by offensive security, is a professional penetration testing operating system, based on debian and uses an FHS-compliant system. This means that the operating system is more stable, and is able to call all of the tools from any directory, regardless of your position in the directory tree. Kali Linux includes all the tools which come with Backtrack, along with a few additions. Linky:http://www.kali.org/Pic (not required):http://www.kali.org/wp-content/uploads/2013/03/kali-home-large-slider2.jpgType of object:***none assigned***Cat:Hacking toolsOS: LinuxI also believe on the page that Link has been misspelled to Linky.edit**I just seen the update where the JavaScript 3 mission is being fixed, so I have to ask. When will we be seeing a patch for that damned application challenge, you all know which one I'm talking about."], "fashizzlepop": ["Future missions are likely to include this. We've discussed this a lot in the past and all are agreed this is a decent idea as long as it is implemented correctly. For the old/current missions I've brought up having a link to a full blown explanation of the vulnerability, to include how find it and prevent it from happening. The link would be shown upon completetion.", "You mean for Mobile users? That would be the goal of a new mobile interface (which is mostly CSS). Also with a new forum, it would be easier to implement a better mobile experience with the forums as well.That said, an app is most likely out of the question for now, but a m.hts.io (mobile HTS) is likely to come in the near future.hellow533 wrote:How about mission-like interactive tutorials.I assume you mean along the lines of a CodeAcademy style? This is a very good idea and will most likely be implemented when we get past the \"repair\" stage of HTS. Thanks for the input.", "It's something on his end. Guaranteed. But cent's right, gettin a bit off le topic now.", "I disagree. First, .org doesn't stand for anything other than \"organization\" which we are. Second, the site is designed to force the user to learn for themselves. Beating the basic missions is quite easy if you put some effort into it and read everything we provide (hints, clues, descriptions, articles, forums threads, etc). If a user is unwilling to put in the effort to learn, they will not be spoon-fed and they will not do well in NetSec.Edit: I'm not saying the challenges are perfect. They are far from that. They are old, poorly written in some cases, and often more of a needle-in-a-haystack than intelligent puzzles. At the same time, they are \"Missions\" not walkthroughs.", "hehe, its funny because its not.Its just that the trolls haven't found it yet. But there are no ops or anything to keep it noob friendly in case of emergency.History lesson: #coffeesh0p was the former channel of www.coffeesh0p.com a site created by a member of this community some 5 years or so ago. I idle in there because.. I like to sometimes idle in empty legacy channels for way way too long.Now its being taken over by friendly people. I approve of this.", "It's just kinda dumb. If you idle, you can join the channel and be known as the biggest idler. No big deal.Hopefully we can get an OP in there soon to enforce the troll-free zone.", "Works for me. "], "Davison": [], "sharpskater69": ["I attempted to update the list with Kali Linux.I'm not sure if the submission is working correctly. Upon submitting the form, nothing happens from the insert.php script; there is no notification as if the submission was successful or non-successful.Details on my submission:Code: Select allName: Kali LinuxDesc:Kali Linux, a project designed by offensive security, is a professional penetration testing operating system, based on debian and uses an FHS-compliant system. This means that the operating system is more stable, and is able to call all of the tools from any directory, regardless of your position in the directory tree. Kali Linux includes all the tools which come with Backtrack, along with a few additions. Linky:http://www.kali.org/Pic (not required):http://www.kali.org/wp-content/uploads/2013/03/kali-home-large-slider2.jpgType of object:***none assigned***Cat:Hacking toolsOS: LinuxI also believe on the page that Link has been misspelled to Linky.edit**I just seen the update where the JavaScript 3 mission is being fixed, so I have to ask. When will we be seeing a patch for that damned application challenge, you all know which one I'm talking about."], "parakkafaith": ["Going off topic(didn't even read the article) but I find this specific point really interesting.The tech industry, is seems, in particular, seems to have investments and standards placed counter intuitively. People don't care to invest in software bug research( and thus people think rebooting is the answer to all of lifes problems because 'computers just break sometimes' no their fucking precision machines, it's the developers and industry pressure that sucks) but we have high tech server farms cataloging our every on line action and catalog it.but I digress. There are weird trends in the way technological progress is prioritized. It suggests to me that the people in charge aren't tech guys at all. We need more software developers with MBA's.. is basically where my cut off wall of text rant was leading lol", "I think this sums it up pretty well. There's no question in my mind that the tweet was poor judgement by Chris Roberts (unless he was in fact aiming for a news story), but the consistent federal knee-jerking clusterfuck that surfaces whenever something like this happens speaks volumes about these backwards priorities.Sometimes it seems like things only blow up like this when somebody can put a terrorist spin on things, which is horribly easy to do these days with anything relating to cyber \"threats\". Even though the joke was made at the wrong time and place, it was still a very obvious joke. While I understand the need to respond to these things regardless of perceived intentions, I can't help but wonder if we'd all be a little more secure should the powers that be ever decide to focus more on quashing the stigma that comes with responsibly disclosing security vulnerabilities, whether or not there was ever any permission.", "That, basically. I understand their fear of 'going dark', but it's no different than the way it's always been. Besides, the risks don't outweigh the possible benefits; too much power, too little responsibility.", "tremor77 wrote:Addendum: If it were in my power to do so, I would fire every single person involved in the development of this idea because it is that fucking stupid, they have no right to earn taxpayer dollars for that amount of idiocy. I wouldn't even recommend them for drive-thru teller at McDonalds. Seriously.I understand taking this stance, but I think it's important to remember a few things. Consider that the ones proposing this idea are not professionals in any industry that requires them to know how these things work. It would be nice if they did, but in reality we can't expect everyone involved in the process to have a good understanding of things that are this complex. For the record, I don't think any of them are pretending to understand it. This kind of thing is not uncommon, which is why we don't leave all of the important decisions up to one person. Although it's less than ideal that time and money is being wasted on this idea, even if it's just to make the proposition, I don't think \"stupid\" is fair. Ignorant?  Definitely. In their shoes, however, it may not seem like a bad idea to at least pitch this. They've been told it's not possible, but they have all kinds of history books that tell them all about the \"impossible\" things people have achieved. Around here, we know that perfect security is far-fetched and silly to even consider, but it wasn't that long ago that Joseph Bramah had people reasonably convinced otherwise, and not because people used to be stupid. I imagine these people are just hoping for a revolutionary innovation, not just some back pocket crypto-trick. I imagine the majority of these people are good at what they do, but it's obvious that what they do has very little to do with this particular kind of security. Thankfully, it isn't up to them.cyberdrain wrote:I understand their fear of 'going dark', but it's no different than the way it's always been. Besides, the risks don't outweigh the possible benefits; too much power, too little responsibility.I think that's what makes the conversation difficult. One thing outweighing another is inevitable when the industry is essentially an arms race. Although the fear of \"going dark\" seems real enough to justify this kind of proactivity, I think it's reasonable to suspect that this proposition is being made for reasons other than fear. It's hard to say exactly what those reasons are, but it feels like mass surveillance certainly fits the federal agenda nowadays.", "That's an interesting idea, if that were allowed, it would mean squashing any resistance against the way things are, never allowing for change once things get out of hand. Unfortunately we're pretty close to that already. As with every new technology there are those who resist change and those who accept it. The difference in this case being that there is no way to ever decode the encrypted messages when encryption is correctly used. As knowledge is power, not having knowledge means having no power. In this case the balance favours those who use it against any government for e.g. civil disobedience. This is why the right to encrypt things should be protected at all costs in my opinion.", "It would certainly seem that way. This whole iShitstorm really seems to encapsulate the dilemma that is a crypto skeleton key.This trick is nothing new. We see it all the time. Find a terrorist, hypocritically attempt to use the momentum of their terror to dissolve the constitution, void civil liberties, and hope the people stand behind you while you do it. Pretty ridiculous.Apparently the FBI just ended up dishing out cash to get into the phone. If James Comey can't take your freedom, he'll just spend your money. Brilliant.", "This is why I'd recommend people have a password they don't use for anything else as their email password. Ideally you don't reuse passwords at all, but for those that can't be bothered, at the very least do it for your email."], "JohnyWalter": ["hey! i am very much intrested... "], "Atul_Tripathi": [], "-Ninjex-": ["We can always add stego later (and probably will)  ", "You mean for Mobile users? That would be the goal of a new mobile interface (which is mostly CSS). Also with a new forum, it would be easier to implement a better mobile experience with the forums as well.That said, an app is most likely out of the question for now, but a m.hts.io (mobile HTS) is likely to come in the near future.hellow533 wrote:How about mission-like interactive tutorials.I assume you mean along the lines of a CodeAcademy style? This is a very good idea and will most likely be implemented when we get past the \"repair\" stage of HTS. Thanks for the input.", "Add TCPdump and Dsniff to the list.", "I attempted to update the list with Kali Linux.I'm not sure if the submission is working correctly. Upon submitting the form, nothing happens from the insert.php script; there is no notification as if the submission was successful or non-successful.Details on my submission:Code: Select allName: Kali LinuxDesc:Kali Linux, a project designed by offensive security, is a professional penetration testing operating system, based on debian and uses an FHS-compliant system. This means that the operating system is more stable, and is able to call all of the tools from any directory, regardless of your position in the directory tree. Kali Linux includes all the tools which come with Backtrack, along with a few additions. Linky:http://www.kali.org/Pic (not required):http://www.kali.org/wp-content/uploads/2013/03/kali-home-large-slider2.jpgType of object:***none assigned***Cat:Hacking toolsOS: LinuxI also believe on the page that Link has been misspelled to Linky.edit**I just seen the update where the JavaScript 3 mission is being fixed, so I have to ask. When will we be seeing a patch for that damned application challenge, you all know which one I'm talking about.", "I'm not quite sure I understand what you are saying here.Basically, if you attempt to login and you don't get the correct username and password with the first try, you will have to answer to a captcha. This helps with security. It will block people from using tools to attempt to login as someone thousands, if not millions of times with different passwords.", "I'm not part of the dev team, but I believe this forum is a bit separate from the rest of hts. This forum needs to issue a unique session ID to the user, and it's powered by phpBB, so I am assuming it's some source compiled and ran on the server that takes care of all that. To be short, I believe you have to click to login, once you do, it checks if you are logged into the main hts page with a valid session, etc, if that passes, it will log you into the forum with your unique session id and username here.However, I could be wrong about all of this.", "Same here, sounds like he should check into his actual computers security. It doesn't look like anything related to the form used for changing the password from my pov.", "It's something on his end. Guaranteed. But cent's right, gettin a bit off le topic now.", "Flawless", "This something that many many people have asked for and it's been in high debate in the IRC chat #cofeesh0p for a while now.", "I don't like to miss an opportunity for a social experiment on irc. If it turns out to be needed then I'll register or let someone else register and set some ops.But in my opinion, some of the best channels don't even need ops, even if ops exist almost no one knows who they are and it only gets used in case of emergency every few years or so. Maintaining a pleasant environment is more up to the users than to those that need to punish offenders.Want to kill a troll? Shower it with kindness. 60% of the time it works every time.", "+You will get the chance to learn some IRC stuff as you had been curious about on your old post.", "Thanks for the history lesson, weekend.  ", "Busy with college among other things. We could almost say the same about you!", "Really? And I quote (from the first 2 pages):Monica wrote:weekend, mmmmmmmmm....limdis wrote:mooka get in here you are missing outxRobin3x3x wrote:Hi, hope you don't mind, i needed a refill on coffee.tremor77 wrote:What is this coffeesh0p? I didn't read the first post.. yes i'm trolling.. just wanted to say hi to Limdis!Oh, look at all that off-topicness (and I vote to keep it that way). But hey, I'm just the messenger "], "SE7EN7NS": ["hey! i am very much intrested... "], "Kodak_timmy": [""], "fr4nc1stein": [], "mdmister12": ["Code: Select all[img][url][/url][/img]"], "xXspl0itXx": ["Hey limdis, I sent an email to staff.  I hope to hear back from you guys soon!-- Thu May 12, 2016 9:24 am --Message to all the staff mainly Ninjex, Limdis, Kage, and Weekend. This is for the front end dev volunteering that I interviewed with ninjex for:Since I keep hopping on the IRC at bad times, I just wanted to let you guys know so you don't miss my message and to ensure you guys get it. I interviewed with ninjex, went pretty well. He asked me to do a project, I've been really busy the last few weeks, just got kicked out of my place to stay and I have about 2 months with a buddy of mine to get a new place to live, so I've had a really rough past month or so and I'm in a transitional/waiting period for a new job and living quarters. Due to that, I have a lot of time to wait. I've decided for my project I'm going to make a sample modern version of the HTS website. If you guys would like me to do something different let me know but for now that's what I've decided for my project. Credit to limdis for helping me pick something to do.I really love the concept of this site and I would be a very happy little hacker if our community grows. I think the outdated style of the website kind of draws people away from it or makes them hesitant to use it to learn. and I want to help change that. Sorry I've been slacking with this project but like I said I've had a really rough past few weeks.Anyways, I love this site, I would love to be part of your team, and I would love to help in any way I can and I hope you guys bring me on to the team. I think working with you guys would be an amazing opportunity and it would help me build my webdev portfolio EXTREMELY, but overall I just want to give back to the community.Thank you all for reading, I hope you guys have a good day. I believe ninjex has my email. If you guys would like to contact me then please feel free to PM on the forums on here, or the main website messaging, or by emailing me. Happy hacking!  "], "ghostheadx2": ["It's certainly a bit overkill to detain this guy for hours... what they should have been concerned with was learning how or if the plane was actually compromised and patched the problem.  Society is too swift to condemn individual acts of (really like that term:) cybercomedy.  While not quite a safe thing to do, he could have been smarter about it, but still they didn't have to jump down his throat.They should have talked to Chris in a peer-to-peer setting, get some kind of report on what it took to hack the plane systems.  They could learn how to keep this from happening, or redirect a potential malicious attacker to an in-flight honeypot or something.He probably should have gotten in touch with the airline and disclosed the vulnerability quietly though... a website is one thing, a chunk of metal hurling through the air, a little different... ^^^highly agree with pretentious, in which we need more software developers in this world that are educated.  Perhaps even focused solely on hardening programs and making them more robust instead of pumping out new, pretty-looking shit that is full of vulnerabilities...I still remember when Vista came out... Microsoft's commercials were focused on, \"oh wow, it looks great!\"  Not once did I hear a commercial say, \"it's robust, solid, and very few bugs!  This sucker will stand up to attacks for days!\"  Nope... appearance is all that matters apparently...Education is what this world needs, and a learning mentality instead of persecution mentality."], "pretentious": ["", "I'm so out of the loop these days but I'm hearing less and less about PHP. It's like flash, was absolutely dominant for a good few years and fell off the map. I've always wanted to contribute to this site but I imagine the technical debt would be exhausting.Good luck guys, hope you aren't dead.", "I've got version 2999 in a folder on my desktop. My upgrade license ran out. Super down about it.", "something you can quickfix?the anti-exploit system on basic missions 8&9 is way too strict, to the point where even solution found online don't work anymore. You could fix that.-- Thu Oct 01, 2015 9:33 am --also, you could try having people go to the Https version of the site by default. that would actually be amazing.-- Thu Oct 01, 2015 9:35 am --I do like my websites to be dark though, it's just so much easier on the eyes.", "Hell yeah! I smile whenever I see Justin Biebers face pasted on the banner  ", "We haven't ported our site to other languages. Have you tried using a translating service? Google can offer some help there to make things easier.", "beforem3 wrote:Hi, I hope I can still post on this topic for an idea... anyway.I was looking for books in the specific forum and I think you can make a survey for books. Votes of members with a really high rank in users ranking are higher than votes by members like me that have a really low rank.I think in this way we can have a list of books ranked by hackers.What do you think?CheersWell apart from recommending you check out the books subforum, This isn't a bad idea, thing that jumps out at me though is that when I look on amazon for books, I will check the star rating, no doubt. But I pay more attention to the qualitative reviews people have given, which is what you will find in the books sub forum.", "Someone who isn't me should definitely jump onto this ", "So thinking about something and talking about that is a crime? Or is this just another thing that got them scared out of their wits knowing no-one thought about it before and someone actually points out the risks?tremor77 wrote:We would detain an EOD Specialist, et al.. had they made a threat to act in a harmful manner. I have been employed as a security researcher... my job is to do the research and submit my findings to the proper management/administration, so that it may get fixed, not to tweet a potential 0-day or vulnerability for every other hacker in the world to see and then potentially use. So Roberts' was displeased that the airlines response was slow in fixing things he had found, does that make it right to do what he did?It's industry standard to disclose bugs who haven't been fixed after a while too. While I don't know how long this particular item was held back or how slow the response was and while the phrasing was off, the intent of joking was obvious to me. Apparently others didn't think so.tremor77 wrote: Even in joking, it is a massive lack of judgement on Roberts' behalf in not understanding the consequences beyond his self-centered and self-important little world. His tweet was a calculated and either career or politically motivated planned action to cause the ensuing debate around it. We should not forget that. I don't care to speculate about that (same could be said about the response) or do you have some proof to back that up?I'm not saying staying idle was the best response. However, at the risk of speculating myself and backed up by previous cases, the way it was handled was clearly to scare others into not doing it. It creates an environment where security-holes remain open and exploitable for criminals as well as the good guys, something that's even worse in my opinion.", "Going off topic(didn't even read the article) but I find this specific point really interesting.The tech industry, is seems, in particular, seems to have investments and standards placed counter intuitively. People don't care to invest in software bug research( and thus people think rebooting is the answer to all of lifes problems because 'computers just break sometimes' no their fucking precision machines, it's the developers and industry pressure that sucks) but we have high tech server farms cataloging our every on line action and catalog it.but I digress. There are weird trends in the way technological progress is prioritized. It suggests to me that the people in charge aren't tech guys at all. We need more software developers with MBA's.. is basically where my cut off wall of text rant was leading lol", "This is actually why I don't try very hard to secure my shit. If you have information to protect, figure out who wants it and how badly they want it, how much effort they are willing to go to, to get it. Then you can design your security practices around that. If I wanted to keep a secret from every bureaucratic body known to man, regardless of the resources they possess. I would encrypt my stuff with the most secure algorithm I could and they open it up in a hex editor and flip some bits and corrupt it. It's ad hoc 2 factor authentication with plausible deny-ability and with that comes the chance that I myself forget what I did and it's lost forever. I've never tried this or gone beyond speculation because, being honest, I don't really have any secrets worth hiding(This is the part where I get doxed and my life falls apart ). And if you do, maybe there's more important things in life bro. Random wall of text, You're all welcome."], "Synchronium": ["Works for me. ", "Thanks for the history lesson, weekend.  "], "MadM0use": ["YES, Its basic black box algebra man  lolill give you a hint to refresh your memory and get you to look it up.f(x) = ???f(1) -> 2f(2) -> 4f(3) -> 6", "I agree with hellow533. It would be much better if his idea would be implemented as it will make users stick to the site.HTS users are mostly teenagers who want to learn to hack but they also have to study and so cannot devote much time to finding and learning stuff on other sites and completing mission on HTS.I joined HTS to learn hacking and hoped to find tutorials and missions based on them.But i have to learn stuff from other sites. Missions are a great help though.HTS is good but it would be amazing if we get tutorials on the site itself.Yet i appreciate the site owner's effort as he puts no ads and runs this site entirely by his money and donations.", "I already do this  and when the challenge goes unsolved for a REALLLY long time, i make it public in the forums."], "ghost_xD": ["I'm not quite sure I understand what you are saying here.Basically, if you attempt to login and you don't get the correct username and password with the first try, you will have to answer to a captcha. This helps with security. It will block people from using tools to attempt to login as someone thousands, if not millions of times with different passwords.", "I'm not part of the dev team, but I believe this forum is a bit separate from the rest of hts. This forum needs to issue a unique session ID to the user, and it's powered by phpBB, so I am assuming it's some source compiled and ran on the server that takes care of all that. To be short, I believe you have to click to login, once you do, it checks if you are logged into the main hts page with a valid session, etc, if that passes, it will log you into the forum with your unique session id and username here.However, I could be wrong about all of this."], "Benway101": [], "NightArcher": ["Ty, i appreciate it. "], "Jbraithwaite": ["Nice! Thanks for the submission! I like that old school look to it.", "Ya after I went and diddled about with photoshop for an hour and posted a quick image i made, I re-read my original post and felt it made me look like a nerdy-try-hard..  lol -  I like what JB did I was trying to think of encrypting some message into mine or using some greater symbolism but the creativity just ain't in my head these days....Updated my logo with a fun stego / brain teaser challenge - most all the clues are available in the image, only some minimal guessing required...    http://pwn9.org/images/hts4.png", "Nice, now we're getting somewhere..  I still need some creative inspiration but I'm hoping someone might try to tackle my stego for gigglesEdit: got some inspiration and tried something different:  http://pwn9.org/images/hts5.png", "We can always add stego later (and probably will)  ", "I agree. Perhaps if that was a fedora or something, that'd be titties."], "WallShadow": ["Heh, yes you can, same for me. It's great you remember me though. I keep checking the site once in a while, but usually I don't log in. Being here taught me an important lesson: once you start learning it's hard to stop (no matter where I am).@Limdis: To be honest: I didn't check IRC, so if you're talking about that...", "feel free to come to irc and hang around #coffeesh0p and say hi, there's usually someone alive at least half the time there."], "phpholly": ["The good news is that they can't keep doing that, so they'll have to invest a lot to actually gain access to new phones."], "tremor77": ["Nice! Thanks for the submission! I like that old school look to it.", "Ya after I went and diddled about with photoshop for an hour and posted a quick image i made, I re-read my original post and felt it made me look like a nerdy-try-hard..  lol -  I like what JB did I was trying to think of encrypting some message into mine or using some greater symbolism but the creativity just ain't in my head these days....Updated my logo with a fun stego / brain teaser challenge - most all the clues are available in the image, only some minimal guessing required...    http://pwn9.org/images/hts4.png", "Nice, now we're getting somewhere..  I still need some creative inspiration but I'm hoping someone might try to tackle my stego for gigglesEdit: got some inspiration and tried something different:  http://pwn9.org/images/hts5.png", "Nice!", "Busy with college among other things. We could almost say the same about you!", "We should also consider the flip side of this.. first of all, I'm going to assume or hope at least, that if I made a tweet with all my 21 followers, about hacking a plane while I was on a plane, that it more or less would go unnoticed?  (Correct me if you think this is wrong).  Does our cyber security apparatus have the ability to find these tweets as such, or is it that Chris Roberts has already established a high profile, and deliberately planned for this tweet to be seen as much as a media gag to get noticed as anything else?Secondly, a threat against a passenger aircraft or airport, bomb or otherwise, is a federal crime. Whether or not the threat is substantial, credible or joking, it does not matter.. the threat is the crime. It causes panic amongst passengers and the loved ones of passengers, it causes airlines and airports to change flights, delay flights, and it mobilizes security personnel to assess the threat irregardless of whether or not they believe it to be substantial, credible or joking.. because if they disregard a threat that becomes something, all holy hell will break loose in asking why they didn't act.  All this to the tune of tens of millions of taxpayer dollars and economic interuption - all for a tweet or a phone call or a letter.  Even in joking, it is a massive lack of judgement on Roberts' behalf in not understanding the consequences beyond his self-centered and self-important little world.  His tweet was a calculated and either career or politically motivated planned action to cause the ensuing debate around it.  We should not forget that.  We would detain an EOD Specialist, et al.. had they made a threat to act in a harmful manner. I have been employed as a security researcher... my job is to do the research and submit my findings to the proper management/administration, so that it may get fixed, not to tweet a potential 0-day or vulnerability for every other hacker in the world to see and then potentially use.  So Roberts' was displeased that the airlines response was slow in fixing things he had found, does that make it right to do what he did?", "So thinking about something and talking about that is a crime? Or is this just another thing that got them scared out of their wits knowing no-one thought about it before and someone actually points out the risks?tremor77 wrote:We would detain an EOD Specialist, et al.. had they made a threat to act in a harmful manner. I have been employed as a security researcher... my job is to do the research and submit my findings to the proper management/administration, so that it may get fixed, not to tweet a potential 0-day or vulnerability for every other hacker in the world to see and then potentially use. So Roberts' was displeased that the airlines response was slow in fixing things he had found, does that make it right to do what he did?It's industry standard to disclose bugs who haven't been fixed after a while too. While I don't know how long this particular item was held back or how slow the response was and while the phrasing was off, the intent of joking was obvious to me. Apparently others didn't think so.tremor77 wrote: Even in joking, it is a massive lack of judgement on Roberts' behalf in not understanding the consequences beyond his self-centered and self-important little world. His tweet was a calculated and either career or politically motivated planned action to cause the ensuing debate around it. We should not forget that. I don't care to speculate about that (same could be said about the response) or do you have some proof to back that up?I'm not saying staying idle was the best response. However, at the risk of speculating myself and backed up by previous cases, the way it was handled was clearly to scare others into not doing it. It creates an environment where security-holes remain open and exploitable for criminals as well as the good guys, something that's even worse in my opinion.", "tremor77 wrote:Addendum: If it were in my power to do so, I would fire every single person involved in the development of this idea because it is that fucking stupid, they have no right to earn taxpayer dollars for that amount of idiocy. I wouldn't even recommend them for drive-thru teller at McDonalds. Seriously.I understand taking this stance, but I think it's important to remember a few things. Consider that the ones proposing this idea are not professionals in any industry that requires them to know how these things work. It would be nice if they did, but in reality we can't expect everyone involved in the process to have a good understanding of things that are this complex. For the record, I don't think any of them are pretending to understand it. This kind of thing is not uncommon, which is why we don't leave all of the important decisions up to one person. Although it's less than ideal that time and money is being wasted on this idea, even if it's just to make the proposition, I don't think \"stupid\" is fair. Ignorant?  Definitely. In their shoes, however, it may not seem like a bad idea to at least pitch this. They've been told it's not possible, but they have all kinds of history books that tell them all about the \"impossible\" things people have achieved. Around here, we know that perfect security is far-fetched and silly to even consider, but it wasn't that long ago that Joseph Bramah had people reasonably convinced otherwise, and not because people used to be stupid. I imagine these people are just hoping for a revolutionary innovation, not just some back pocket crypto-trick. I imagine the majority of these people are good at what they do, but it's obvious that what they do has very little to do with this particular kind of security. Thankfully, it isn't up to them.cyberdrain wrote:I understand their fear of 'going dark', but it's no different than the way it's always been. Besides, the risks don't outweigh the possible benefits; too much power, too little responsibility.I think that's what makes the conversation difficult. One thing outweighing another is inevitable when the industry is essentially an arms race. Although the fear of \"going dark\" seems real enough to justify this kind of proactivity, I think it's reasonable to suspect that this proposition is being made for reasons other than fear. It's hard to say exactly what those reasons are, but it feels like mass surveillance certainly fits the federal agenda nowadays."], "Wickey": ["hey! i am very much intrested... "], "Ayr3s": ["Nice! Thanks for the submission! I like that old school look to it.", "I agree. Perhaps if that was a fedora or something, that'd be titties."], "joyclark": ["I've got version 2999 in a folder on my desktop. My upgrade license ran out. Super down about it.", ""], "syn_awa": ["We can always add stego later (and probably will)  "], "cazzofresco": [], "tripbeam": ["Flawless"], "VvGHOSTvV": [], "IDNeon": ["Oh, yes, I am. I've been looking for opportunities to DJ on the Internetz before taking to the radio.-- Fri Nov 07, 2014 9:53 am --cyberdrain wrote:While I'm hesitant to shoot down a good idea, please consider the implications of what you're asking: what is it you would want to hear, what would be done there and who should do it? Aside from those practical problems, I see no reason not to start it up again.Your concerns are, of course, very valid. We should probably start a poll concerning the content. Then, we'd have to find a host site to have the audio-stream on. I'd be glad to take on whatever early responsibilities there are with starting the station that haven't already been assigned/taken. If anybody volunteers, all positions are open.", "I'd like to see more webpages and member areas that are only accessible BY hacking.It's one thing to have missions, but it'd be cool if like a secret society you could only access a deep message board somewhere i you knew how to hack it.  Make them also beginner, middle, expert levels."], "anuca0018": ["Thanks for the reply. Well, I have a dual-boot for Windows X and Ubuntu. Now, this brings me to another problem. My Ubuntu went all tard on me. It loads but there is not way to close windows and I cannot get to the Terminal to fix my Ubuntu. When it boots it gives me an error. I know how to set the root and the prefix and get the ins mod to load normal, but I don't know how to fix my Ubuntu. Do I just format the partition and start over? But then if I do, I know my Windows will spasm when I re-load the Ubuntu onto the system. Anyway... I am the ultra NOOB. I want to be decent at hacking, but am a latent learner and feel like I might have missed the \"train\" for becoming a great hacker. I am just rambling. Ultimately, I have mIRC downloaded, but I will try the server you offered. I really need to get with it and learn as much as I can. Thanks again.", "hey! i am very much intrested... "], "Monica": ["I don't like to miss an opportunity for a social experiment on irc. If it turns out to be needed then I'll register or let someone else register and set some ops.But in my opinion, some of the best channels don't even need ops, even if ops exist almost no one knows who they are and it only gets used in case of emergency every few years or so. Maintaining a pleasant environment is more up to the users than to those that need to punish offenders.Want to kill a troll? Shower it with kindness. 60% of the time it works every time."], "anonymous501": ["This is a great idea. We've been pondering these challenges for a while now and will (hopefully) start pushing some out in the near future.Thanksgiving Paltry wrote:Well, one thing I would add is a more professional looking theme. It's nothing against you guys, but it just looks unprofessionally dark. I know this website is supposed to be educational, but to be taken seriously in that respect you kinda have to look the part.This is something that we're all in a debate about. We are certainly going to update the layout, but the debate is on what theme we want to end up using.", "something you can quickfix?the anti-exploit system on basic missions 8&9 is way too strict, to the point where even solution found online don't work anymore. You could fix that.-- Thu Oct 01, 2015 9:33 am --also, you could try having people go to the Https version of the site by default. that would actually be amazing.-- Thu Oct 01, 2015 9:35 am --I do like my websites to be dark though, it's just so much easier on the eyes.", "Hell yeah! I smile whenever I see Justin Biebers face pasted on the banner  ", "Cause cicada 3301 doesnt like competition  . That kind of mission would be fun but there are some problems. There used to be doxing mission but now its defunct because people were posting solutions and google search results didnt appear like they were supposed too  .", "If you need any translations for Dutch, give me a call. (or send me a message, if you can't find my phone number)."], "simonsickle": ["I disagree. First, .org doesn't stand for anything other than \"organization\" which we are. Second, the site is designed to force the user to learn for themselves. Beating the basic missions is quite easy if you put some effort into it and read everything we provide (hints, clues, descriptions, articles, forums threads, etc). If a user is unwilling to put in the effort to learn, they will not be spoon-fed and they will not do well in NetSec.Edit: I'm not saying the challenges are perfect. They are far from that. They are old, poorly written in some cases, and often more of a needle-in-a-haystack than intelligent puzzles. At the same time, they are \"Missions\" not walkthroughs."], "beform3": ["We haven't ported our site to other languages. Have you tried using a translating service? Google can offer some help there to make things easier."], "03_nemesis_22": ["Very much so! Sometimes it gets quiet during certain times of the day but it does stay fairly active."], "Dark": ["YES, Its basic black box algebra man  lolill give you a hint to refresh your memory and get you to look it up.f(x) = ???f(1) -> 2f(2) -> 4f(3) -> 6", "I agree with hellow533. It would be much better if his idea would be implemented as it will make users stick to the site.HTS users are mostly teenagers who want to learn to hack but they also have to study and so cannot devote much time to finding and learning stuff on other sites and completing mission on HTS.I joined HTS to learn hacking and hoped to find tutorials and missions based on them.But i have to learn stuff from other sites. Missions are a great help though.HTS is good but it would be amazing if we get tutorials on the site itself.Yet i appreciate the site owner's effort as he puts no ads and runs this site entirely by his money and donations."], "xRobin3x3x": ["I don't like to miss an opportunity for a social experiment on irc. If it turns out to be needed then I'll register or let someone else register and set some ops.But in my opinion, some of the best channels don't even need ops, even if ops exist almost no one knows who they are and it only gets used in case of emergency every few years or so. Maintaining a pleasant environment is more up to the users than to those that need to punish offenders.Want to kill a troll? Shower it with kindness. 60% of the time it works every time."], "Valar_Dragon": ["Right now, we're pretty focused on trying to overhaul the backend side of HTS. That is our primary focus at this point as it will (hopefully) bring in some more traffic as we push out nicer and better things."], "Dragon_law": [], "phatez": ["Hell yeah! I smile whenever I see Justin Biebers face pasted on the banner  "], "centip3de": ["You can log into the IRC server directly, there's no need to go through the browser for your client. Server: irc.hackthissite.orgDefault port: 6667SSL Ports: 6697,7000Also, you only need to use the DLL if you want to make things easier for you over SSL with mIRC. It's most definitely not a required thing to use.", "In '08 or '09 a new version of HTS was released and the forums reset (as far as I know) which is why you won't find anyone with a join date before then (including administrators like Kage, weekend, or ScrAm).", " The IRC link does not simply display the IRC info; it actually prompts to open the IRC client. I had to pull the info out of the bitch boxes. Afterwards I tried numerous times to connect to the server and was denied. Upon reading the IRC help I noticed the .DLLs and the instructions really seem like the .DLLs are required. SOOOOOOOO?....... and yes I manually did a 7000 port in the client.", "As this link states:That link wrote:Most users are using mIRC, a very nice Windows IRC client. HackThisSite has taken the effort to make using SSL on mIRC a little easier. Also note that below that it shows how to get it working with X-Chat, something that doesn't require any DLL's, just the '-ssl' flag. Or, you could use IRSSI (like I do) that also doesn't require you to install a DLL for SSL to be enabled.", "Wait, what? I just reset my password and didn't get anything remotely similar to that. If this is a reoccurring issue, you should definitely contact someone on the dev team because as far as I know, that shouldn't be happening. daedeluslanthanien wrote:I really enjoyed the retraction of the .DLL advice by switching to advice to move to Linux  I didn't advocate for Linux use, actually. I said that if you didn't feel like installing the DLL (which is recommended, not necessary) that you could try other IRC alternatives that run on Windows such as X-Chat, or IRSSI (though these also run on *nix, I never said you should change your OS just to connect to IRC over SSL). daedeluslanthanien wrote:It is a no-brainer considering the normal impulse of 31337 Linux users to engage in 31337 ass-hattery IMO. There are Linux guys like myself who reject this impulse and casually teach without the flip-flop. The methods that seem to provide guidance to the newbs and the nasty lil Java IRC plugin is actually a very lame way to root their machines, again, IMHO. Java IS trashed, you know it, I know it.Just... just... just... wat.daedeluslanthanien wrote:Thank God Jeremy will only get 10 years...... I think he will come back.I doubt it. If you'd like to continue this conversation, either do it over a PM, or IRC (you can find me in #coffeesh0p usually), we're going quite a bit off topic now.", "I disagree. First, .org doesn't stand for anything other than \"organization\" which we are. Second, the site is designed to force the user to learn for themselves. Beating the basic missions is quite easy if you put some effort into it and read everything we provide (hints, clues, descriptions, articles, forums threads, etc). If a user is unwilling to put in the effort to learn, they will not be spoon-fed and they will not do well in NetSec.Edit: I'm not saying the challenges are perfect. They are far from that. They are old, poorly written in some cases, and often more of a needle-in-a-haystack than intelligent puzzles. At the same time, they are \"Missions\" not walkthroughs.", "Every mission states what is needed to complete it and gives you resources in doing so. To explain every topic that the missions cover would take a ton of time that we don't really have, which is why we link to outside material."], "Olbrack": ["If only something like that existed..."], "abdulbadii": [], "weekend": ["hehe, its funny because its not.Its just that the trolls haven't found it yet. But there are no ops or anything to keep it noob friendly in case of emergency.History lesson: #coffeesh0p was the former channel of www.coffeesh0p.com a site created by a member of this community some 5 years or so ago. I idle in there because.. I like to sometimes idle in empty legacy channels for way way too long.Now its being taken over by friendly people. I approve of this.", "It's just kinda dumb. If you idle, you can join the channel and be known as the biggest idler. No big deal.Hopefully we can get an OP in there soon to enforce the troll-free zone.", "I don't like to miss an opportunity for a social experiment on irc. If it turns out to be needed then I'll register or let someone else register and set some ops.But in my opinion, some of the best channels don't even need ops, even if ops exist almost no one knows who they are and it only gets used in case of emergency every few years or so. Maintaining a pleasant environment is more up to the users than to those that need to punish offenders.Want to kill a troll? Shower it with kindness. 60% of the time it works every time."], "rust_2014": [], "Meltdwn": ["Works for me. "], "silence27trey": [], "aaa12345": [], "PavelG": [], "sherlock_beard": [], "geek_luce_newbee": []}